entries/org-mode-jekyll-plugin/index.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>An Org-Mode Jekyll Plugin</title>
    <meta name="viewport" content="width=device-width">
    <meta name="description" content="My personal place to write about the things I find interesting. Programming, Lisp, Ruby, Emacs, etc.">
    <link rel="canonical" href="http://joelmccracken.github.io/entries/org-mode-jekyll-plugin/">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/main.css">

</head>

    <body>

    <header class="site-header">

  <div class="wrap">

    <a class="site-title" href="/">Joel's Journal</a>

    <nav class="site-nav">
      <a href="#" class="menu-icon">
        <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
           viewBox="0 0 18 15" enable-background="new 0 0 18 15" xml:space="preserve">
          <path fill="#505050" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0
            h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
          <path fill="#505050" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484
            h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
          <path fill="#505050" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0
            c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
        </svg>
      </a>
      <div class="trigger">
        <a class="page-link" href="/about">About</a>
        <a class="page-link" href="/projects">Projects</a>
      </div>
    </nav>

  </div>

</header>

    <div class="page-content">
      <div class="wrap">
      <div class="post">

  <header class="post-header">
    <h1>An Org-Mode Jekyll Plugin</h1>
    <p class="meta">May 19, 2014</p>
  </header>

  <article class="post-content">
  <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The Jekyll Plugin</a>
<ul>
<li><a href="#sec-1-1">1.1. The Matches Method</a></li>
<li><a href="#sec-1-2">1.2. The Convert Method</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. IO Pipes</a></li>
<li><a href="#sec-1-2-2">1.2.2. Spawning Emacs</a></li>
<li><a href="#sec-1-2-3">1.2.3. Reading the Output from Emacs &amp; Cleaning Up</a></li>
<li><a href="#sec-1-2-4">1.2.4. All Together</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. The Full Plugin</a></li>
</ul>
</li>
<li><a href="#sec-2">2. The Emacs Lisp</a></li>
<li><a href="#sec-3">3. Final Thoughts</a></li>
</ul>
</div>
</div>
<p>
I have wanted to write blog posts with Org-mode for a long time, but it
never bothered me enough to want to actually sit down and write one,
until recently. It ended up being rather interesting.
</p>

<p>
I don't think I have ever written about literate programming<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>, but I
think it is one of the most powerful and under-explored concepts in
computer engineering. Org mode has fantastic facilities for doing
literate programming, and as that is a primary motivation for using
Org mode, this document is written in a literate style. You may find
the source <a href="https://github.com/joelmccracken/joelmccracken.github.com/blob/writing/_posts/2014-05-19-org-mode-jekyll-plugin.org">here</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Jekyll Plugin</h2>
<div class="outline-text-2" id="text-1">
<p>
Jekyll has a plugin architecture that supports defining new structure
types. The documentation for creating a converter for file types is
found <a href="http://jekyllrb.com/docs/plugins/#converters">here</a>.
</p>


<p>
A converter is a class that gets instantiated within Jekyll. Its
<code>matches</code> method is used to determine if the converter should
be used for this file type. 
</p>

<p>
Assuming that <code>matches</code> returns true, the <code>convert</code>
method is called. It is passed the content of the document it needs to
convert, and should return the output for publishing. 
</p>

<p>
A plugin's overall structure looks like this:
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="org-converter-plugin-structure">module Jekyll
  class OrgConverter &lt; Converter
    safe true
    priority :low

    def matches(ext)
      # simple code that jekyll uses to determine if this
      # converter should be used
    end

    def output_ext(ext)
      ".html"
    end

    def convert(content)
      # code to convert the org text to html text
    end
  end
end
</pre>
</div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> The Matches Method</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We need to fill in the missing pieces.
</p>

<p>
The easiest part to handle is the body of matches, which ends up being
a very simple regular expression:
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="matches-definition">def matches(ext)
  ext =~ /^\.org$/i
end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> The Convert Method</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The goal is to use Emacs and Org-mode to do the conversion.
To do this, we run an emacs instance in batch mode, write the post
content to its standard input, and have the emacs process write the
content to standard output.
</p>

<p>
Briefly, the function works as follows: 
</p>
<ol class="org-ol">
<li>IO pipes are created for communicating with the emacs process. 
</li>
<li>The content of the org document is written to the input pipe.
</li>
<li>Emacs is run via the <code>spawn</code> method, and sets up the input
and output pipes.
</li>
<li>When Emacs finishes, the resulting html is read from the output
pipe. 
</li>
</ol>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> IO Pipes</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
It took me some time to settle on this code. I wanted to use
<code>spawn</code> since it was recommended on the Parley group, and I
had never used it before.
</p>

<p>
This use case seemed like a clear candidate for <code>StringIO</code>,
but apparently <code>StringIO</code> doesn't work with <code>spawn</code>.
The next best thing is using IO pipes.
</p>

<p>
Most of us are probably familiar with pipes as they are used in Bash,
but inside of a Unix program they look different. A pipe consists of
two file descriptors, the "input FD" and the "output FD". Information
that is written to the input FD is then available on the output
FD. However, we actually need two pipes: One for providing input to
the emacs process, and one for reading the output from the emacs
process. Since each pipe is two file descriptors, that means there are 
four open file descriptors in total.
</p>


<p>
Thus, we create a pipe for spawn's input, a pipe for spawn's output,
and write the org document content to the input pipe:
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="io-pipes">inread, inwrite = IO.pipe
outread, outwrite = IO.pipe

inwrite.write content
inwrite.close
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Spawning Emacs</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Next, we construct the emacs invocation string, and hook up the file
descriptors to the process:
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="spawn-emacs">emacs_execution_string = "emacs -Q --batch -L " \
  "_vendor/org-8.2.6/lisp/ -l _lib/org-convert.el -f compile-org-file"
org_pid = spawn(emacs_execution_string, :in =&gt; inread, :out =&gt; outwrite, :err =&gt; :out)
</pre>
</div>

<p>
Some notes on the Emacs command and arguments:
</p>

<ul class="org-ul">
<li>"-Q" makes emacs start up with the minimal number of
libraries, which is much faster.
</li>
<li>"&#x2013;batch" makes emacs start up in a "shell" mode, designed for
scripting.
</li>
<li>"-L" adds a directory to emacs' load path. Here, we have specified a
directory ("<sub>vendor</sub>/org-8.2.6/lisp/"), which contains the org mode
source our emacs will use.
</li>
<li>"-l" actually loads a file. The contents of this file are executed.
</li>
<li>"-f" runs a function in emacs. The <code>compile-org-file</code>
  function is defined in "org-convert.el".
</li>
</ul>

<p>
<code>emacs_execution_string</code> is run with <code>spawn</code>, which is
passed the pipe endpoint file descriptors that were described earlier.
The process id is saved in the variable <code>org_pid</code>, which we
use later to wait for the process to finish.
</p>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Reading the Output from Emacs &amp; Cleaning Up</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
What remains is to have Jekyll wait for Emacs to finish, read the
output from the Emacs process, and close any open files.
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="read-emacs-output">inread.close
outwrite.close
Process.wait(org_pid)

out_content = outread.read
outread.close
out_content
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> All Together</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
The final definition of the convert method:
</p>

<div class="org-src-container">

<pre class="src src-ruby" id="convert-definition">def convert(content)
  inread, inwrite = IO.pipe
  outread, outwrite = IO.pipe

  inwrite.write content
  inwrite.close
  emacs_execution_string = "emacs -Q --batch -L " \
    "_vendor/org-8.2.6/lisp/ -l _lib/org-convert.el -f compile-org-file"
  org_pid = spawn(emacs_execution_string, :in =&gt; inread, :out =&gt; outwrite, :err =&gt; :out)
  inread.close
  outwrite.close
  Process.wait(org_pid)

  out_content = outread.read
  outread.close
  out_content
end
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> The Full Plugin</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-ruby">module Jekyll
  class OrgConverter &lt; Converter
    safe true
    priority :low

    def matches(ext)
      ext =~ /^\.org$/i
    end

    def output_ext(ext)
      ".html"
    end

    def convert(content)
      inread, inwrite = IO.pipe
      outread, outwrite = IO.pipe

      inwrite.write content
      inwrite.close
      emacs_execution_string = "emacs -Q --batch -L " \
	"_vendor/org-8.2.6/lisp/ -l _lib/org-convert.el -f compile-org-file"
      org_pid = spawn(emacs_execution_string, :in =&gt; inread, :out =&gt; outwrite, :err =&gt; :out)
      inread.close
      outwrite.close
      Process.wait(org_pid)

      out_content = outread.read
      outread.close
      out_content
    end
  end
end
</pre>
</div>
<p>
On to the lisp that does the actual Org mode integration. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Emacs Lisp</h2>
<div class="outline-text-2" id="text-2">
<p>
Much of the body of the <code>convert</code> method was developed in
conjunction with the code from my 
<a href="../reading-writing-data-in-emacs-stdin-stdout/">previous post</a>
about standard input and output in emacs batch mode.
</p>

<p>
Here, we use that same code with a single minor tweak. 
The function <code>org-html-export-as-html</code> accepts an argument to specify
that we want to export the body only, and since the exported org
document is going to be incorporated into a layout that is managed by
Jekyll, we specify <code>t</code> for that setting.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'org)
(require 'ox)
(require 'ox-html)


(defun compile-org-file ()
  (interactive)
  (let ((org-document-content "")
	this-read)
    (while (setq this-read (ignore-errors
			     (read-from-minibuffer "")))
      (setq org-document-content (concat org-document-content "\n" this-read)))

    (with-temp-buffer
      (org-mode)
      (insert org-document-content)
      (org-html-export-as-html nil nil nil t)
      (princ (buffer-string)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Final Thoughts</h2>
<div class="outline-text-2" id="text-3">
<p>
This entire exercise was fun and instructive. I didn't cover
downloading the org mode source to <code>_vendor</code>, but I think that should
be straightforward enough. I do advise byte compiling the org source
&#x2013; it produces a noticeable speedup. 
</p>


<p>
So far, I have written this blog post using this code, and it
works rather well. It would be nice if the compilation process were a
little faster (say, possibly with a persistent Emacs process), but
I will save that for later.
</p>

<p>
If you'd like me to make this code easier for you to consume in some
way (like, if you wanted to actually use it to compile org files in
Jekyll), email me or leave a comment, and I will see what I can do.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
the <a href="http://c2.com/cgi/wiki?LiterateProgramming">c2 Wiki</a> has more on the topic. Knuth's <a href="http://www.literateprogramming.com/knuthweb.pdf">paper</a> (PDF link) on
the topic is an excellent introduction.
</p></div>


</div>
</div>
  </article>

  <div id="disqus_thread"></div>
  <script>
   var disqus_shortname = 'joelmccracken'; // required: replace example with your forum shortname

   var disqus_config = function () {
       this.page.url = "/entries/org-mode-jekyll-plugin/";
       this.page.identifier = "/entries/org-mode-jekyll-plugin";
       this.page.title = "An Org-Mode Jekyll Plugin";
   };

   (function() {  // REQUIRED CONFIGURATION VARIABLE: EDIT THE SHORTNAME BELOW
       var d = document, s = d.createElement('script');

       s.src = '//'+disqus_shortname+'.disqus.com/embed.js';  // IMPORTANT: Replace EXAMPLE with your forum shortname!

       s.setAttribute('data-timestamp', +new Date());
       (d.head || d.body).appendChild(s);
   })();
  </script>
  <noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
</div>

      </div>
    </div>

    <footer class="site-footer">

  <div class="wrap">

    <h2 class="footer-heading">Joel McCracken</h2>

    <div class="footer-col-1 column">
      <ul>
        <li><a href="mailto:mccracken.joel@gmail.com">mccracken.joel@gmail.com</a></li>
      </ul>
    </div>

    <div class="footer-col-2 column">
      <ul>
        <li>
          <a href="https://github.com/JoelMcCracken">
            <span class="icon github">
              <svg version="1.1" class="github-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill-rule="evenodd" clip-rule="evenodd" fill="#C2C2C2" d="M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761
                c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32
                c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472
                c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037
                C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65
                c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261
                c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082
                c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129
                c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
        <li>
          <a href="https://twitter.com/JoelMcCracken">
            <span class="icon twitter">
              <svg version="1.1" class="twitter-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill="#C2C2C2" d="M15.969,3.058c-0.586,0.26-1.217,0.436-1.878,0.515c0.675-0.405,1.194-1.045,1.438-1.809
                c-0.632,0.375-1.332,0.647-2.076,0.793c-0.596-0.636-1.446-1.033-2.387-1.033c-1.806,0-3.27,1.464-3.27,3.27
                c0,0.256,0.029,0.506,0.085,0.745C5.163,5.404,2.753,4.102,1.14,2.124C0.859,2.607,0.698,3.168,0.698,3.767
                c0,1.134,0.577,2.135,1.455,2.722C1.616,6.472,1.112,6.325,0.671,6.08c0,0.014,0,0.027,0,0.041c0,1.584,1.127,2.906,2.623,3.206
                C3.02,9.402,2.731,9.442,2.433,9.442c-0.211,0-0.416-0.021-0.615-0.059c0.416,1.299,1.624,2.245,3.055,2.271
                c-1.119,0.877-2.529,1.4-4.061,1.4c-0.264,0-0.524-0.015-0.78-0.046c1.447,0.928,3.166,1.469,5.013,1.469
                c6.015,0,9.304-4.983,9.304-9.304c0-0.142-0.003-0.283-0.009-0.423C14.976,4.29,15.531,3.714,15.969,3.058z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
      </ul>
    </div>

    <!-- 
    <div class="footer-col-3 column">
      <p class="text">would like to add some rotating content down here</p>
    </div>
    -->
  </div>

</footer>


    <script type="text/javascript">
 var _gaq = _gaq || [];
 _gaq.push(['_setAccount', 'UA-7759066-1']);
 _gaq.push(['_trackPageview']);

 (function() {
   var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
   ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
   var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
 })();
</script>

    </body>
</html>
